ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp153cxx_ca7.h
/*************  Bit definition for RCC_MP_APB1LPENCLRR register  **************/
#define RCC_MP_APB1LPENCLRR_TIM2LPEN_Pos          (0U)
#define RCC_MP_APB1LPENCLRR_TIM2LPEN_Msk          (0x1U << RCC_MP_APB1LPENCLRR_TIM2LPEN_Pos)         /*!< 0x00000001 */
#define RCC_MP_APB1LPENCLRR_TIM2LPEN              RCC_MP_APB1LPENCLRR_TIM2LPEN_Msk                   /*!< TIM2 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENCLRR_TIM3LPEN_Pos          (1U)
#define RCC_MP_APB1LPENCLRR_TIM3LPEN_Msk          (0x1U << RCC_MP_APB1LPENCLRR_TIM3LPEN_Pos)         /*!< 0x00000002 */
#define RCC_MP_APB1LPENCLRR_TIM3LPEN              RCC_MP_APB1LPENCLRR_TIM3LPEN_Msk                   /*!< TIM3 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENCLRR_TIM4LPEN_Pos          (2U)
#define RCC_MP_APB1LPENCLRR_TIM4LPEN_Msk          (0x1U << RCC_MP_APB1LPENCLRR_TIM4LPEN_Pos)         /*!< 0x00000004 */
#define RCC_MP_APB1LPENCLRR_TIM4LPEN              RCC_MP_APB1LPENCLRR_TIM4LPEN_Msk                   /*!< TIM4 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENCLRR_TIM5LPEN_Pos          (3U)
#define RCC_MP_APB1LPENCLRR_TIM5LPEN_Msk          (0x1U << RCC_MP_APB1LPENCLRR_TIM5LPEN_Pos)         /*!< 0x00000008 */
#define RCC_MP_APB1LPENCLRR_TIM5LPEN              RCC_MP_APB1LPENCLRR_TIM5LPEN_Msk                   /*!< TIM5 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENCLRR_TIM6LPEN_Pos          (4U)
#define RCC_MP_APB1LPENCLRR_TIM6LPEN_Msk          (0x1U << RCC_MP_APB1LPENCLRR_TIM6LPEN_Pos)         /*!< 0x00000010 */
#define RCC_MP_APB1LPENCLRR_TIM6LPEN              RCC_MP_APB1LPENCLRR_TIM6LPEN_Msk                   /*!< TIM6 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENCLRR_TIM7LPEN_Pos          (5U)
#define RCC_MP_APB1LPENCLRR_TIM7LPEN_Msk          (0x1U << RCC_MP_APB1LPENCLRR_TIM7LPEN_Pos)         /*!< 0x00000020 */
#define RCC_MP_APB1LPENCLRR_TIM7LPEN              RCC_MP_APB1LPENCLRR_TIM7LPEN_Msk                   /*!< TIM7 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENCLRR_TIM12LPEN_Pos         (6U)
#define RCC_MP_APB1LPENCLRR_TIM12LPEN_Msk         (0x1U << RCC_MP_APB1LPENCLRR_TIM12LPEN_Pos)        /*!< 0x00000040 */
#define RCC_MP_APB1LPENCLRR_TIM12LPEN             RCC_MP_APB1LPENCLRR_TIM12LPEN_Msk                  /*!< TIM12 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENCLRR_TIM13LPEN_Pos         (7U)
#define RCC_MP_APB1LPENCLRR_TIM13LPEN_Msk         (0x1U << RCC_MP_APB1LPENCLRR_TIM13LPEN_Pos)        /*!< 0x00000080 */
#define RCC_MP_APB1LPENCLRR_TIM13LPEN             RCC_MP_APB1LPENCLRR_TIM13LPEN_Msk                  /*!< TIM13 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENCLRR_TIM14LPEN_Pos         (8U)
#define RCC_MP_APB1LPENCLRR_TIM14LPEN_Msk         (0x1U << RCC_MP_APB1LPENCLRR_TIM14LPEN_Pos)        /*!< 0x00000100 */
#define RCC_MP_APB1LPENCLRR_TIM14LPEN             RCC_MP_APB1LPENCLRR_TIM14LPEN_Msk                  /*!< TIM14 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENCLRR_LPTIM1LPEN_Pos        (9U)
#define RCC_MP_APB1LPENCLRR_LPTIM1LPEN_Msk        (0x1U << RCC_MP_APB1LPENCLRR_LPTIM1LPEN_Pos)       /*!< 0x00000200 */
#define RCC_MP_APB1LPENCLRR_LPTIM1LPEN            RCC_MP_APB1LPENCLRR_LPTIM1LPEN_Msk                 /*!< LPTIM1 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENCLRR_SPI2LPEN_Pos          (11U)
#define RCC_MP_APB1LPENCLRR_SPI2LPEN_Msk          (0x1U << RCC_MP_APB1LPENCLRR_SPI2LPEN_Pos)         /*!< 0x00000800 */
#define RCC_MP_APB1LPENCLRR_SPI2LPEN              RCC_MP_APB1LPENCLRR_SPI2LPEN_Msk                   /*!< SPI2 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENCLRR_SPI3LPEN_Pos          (12U)
#define RCC_MP_APB1LPENCLRR_SPI3LPEN_Msk          (0x1U << RCC_MP_APB1LPENCLRR_SPI3LPEN_Pos)         /*!< 0x00001000 */
#define RCC_MP_APB1LPENCLRR_SPI3LPEN              RCC_MP_APB1LPENCLRR_SPI3LPEN_Msk                   /*!< SPI3 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENCLRR_USART2LPEN_Pos        (14U)
#define RCC_MP_APB1LPENCLRR_USART2LPEN_Msk        (0x1U << RCC_MP_APB1LPENCLRR_USART2LPEN_Pos)       /*!< 0x00004000 */
#define RCC_MP_APB1LPENCLRR_USART2LPEN            RCC_MP_APB1LPENCLRR_USART2LPEN_Msk                 /*!< USART2 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENCLRR_USART3LPEN_Pos        (15U)
#define RCC_MP_APB1LPENCLRR_USART3LPEN_Msk        (0x1U << RCC_MP_APB1LPENCLRR_USART3LPEN_Pos)       /*!< 0x00008000 */
#define RCC_MP_APB1LPENCLRR_USART3LPEN            RCC_MP_APB1LPENCLRR_USART3LPEN_Msk                 /*!< USART3 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENCLRR_UART4LPEN_Pos         (16U)
#define RCC_MP_APB1LPENCLRR_UART4LPEN_Msk         (0x1U << RCC_MP_APB1LPENCLRR_UART4LPEN_Pos)        /*!< 0x00010000 */
#define RCC_MP_APB1LPENCLRR_UART4LPEN             RCC_MP_APB1LPENCLRR_UART4LPEN_Msk                  /*!< UART4 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENCLRR_UART5LPEN_Pos         (17U)
#define RCC_MP_APB1LPENCLRR_UART5LPEN_Msk         (0x1U << RCC_MP_APB1LPENCLRR_UART5LPEN_Pos)        /*!< 0x00020000 */
#define RCC_MP_APB1LPENCLRR_UART5LPEN             RCC_MP_APB1LPENCLRR_UART5LPEN_Msk                  /*!< UART5 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENCLRR_UART7LPEN_Pos         (18U)
#define RCC_MP_APB1LPENCLRR_UART7LPEN_Msk         (0x1U << RCC_MP_APB1LPENCLRR_UART7LPEN_Pos)        /*!< 0x00040000 */
#define RCC_MP_APB1LPENCLRR_UART7LPEN             RCC_MP_APB1LPENCLRR_UART7LPEN_Msk                  /*!< UART7 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENCLRR_UART8LPEN_Pos         (19U)
#define RCC_MP_APB1LPENCLRR_UART8LPEN_Msk         (0x1U << RCC_MP_APB1LPENCLRR_UART8LPEN_Pos)        /*!< 0x00080000 */
#define RCC_MP_APB1LPENCLRR_UART8LPEN             RCC_MP_APB1LPENCLRR_UART8LPEN_Msk                  /*!< UART8 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENCLRR_I2C1LPEN_Pos          (21U)
#define RCC_MP_APB1LPENCLRR_I2C1LPEN_Msk          (0x1U << RCC_MP_APB1LPENCLRR_I2C1LPEN_Pos)         /*!< 0x00200000 */
#define RCC_MP_APB1LPENCLRR_I2C1LPEN              RCC_MP_APB1LPENCLRR_I2C1LPEN_Msk                   /*!< I2C1 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENCLRR_I2C2LPEN_Pos          (22U)
#define RCC_MP_APB1LPENCLRR_I2C2LPEN_Msk          (0x1U << RCC_MP_APB1LPENCLRR_I2C2LPEN_Pos)         /*!< 0x00400000 */
#define RCC_MP_APB1LPENCLRR_I2C2LPEN              RCC_MP_APB1LPENCLRR_I2C2LPEN_Msk                   /*!< I2C2 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENCLRR_I2C3LPEN_Pos          (23U)
#define RCC_MP_APB1LPENCLRR_I2C3LPEN_Msk          (0x1U << RCC_MP_APB1LPENCLRR_I2C3LPEN_Pos)         /*!< 0x00800000 */
#define RCC_MP_APB1LPENCLRR_I2C3LPEN              RCC_MP_APB1LPENCLRR_I2C3LPEN_Msk                   /*!< I2C3 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENCLRR_I2C5LPEN_Pos          (24U)
#define RCC_MP_APB1LPENCLRR_I2C5LPEN_Msk          (0x1U << RCC_MP_APB1LPENCLRR_I2C5LPEN_Pos)         /*!< 0x01000000 */
#define RCC_MP_APB1LPENCLRR_I2C5LPEN              RCC_MP_APB1LPENCLRR_I2C5LPEN_Msk                   /*!< I2C5 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENCLRR_SPDIFLPEN_Pos         (26U)
#define RCC_MP_APB1LPENCLRR_SPDIFLPEN_Msk         (0x1U << RCC_MP_APB1LPENCLRR_SPDIFLPEN_Pos)        /*!< 0x04000000 */
#define RCC_MP_APB1LPENCLRR_SPDIFLPEN             RCC_MP_APB1LPENCLRR_SPDIFLPEN_Msk                  /*!< SPDIFRX peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENCLRR_CECLPEN_Pos           (27U)
#define RCC_MP_APB1LPENCLRR_CECLPEN_Msk           (0x1U << RCC_MP_APB1LPENCLRR_CECLPEN_Pos)          /*!< 0x08000000 */
#define RCC_MP_APB1LPENCLRR_CECLPEN               RCC_MP_APB1LPENCLRR_CECLPEN_Msk                    /*!< HDMI-CEC peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENCLRR_DAC12LPEN_Pos         (29U)
#define RCC_MP_APB1LPENCLRR_DAC12LPEN_Msk         (0x1U << RCC_MP_APB1LPENCLRR_DAC12LPEN_Pos)        /*!< 0x20000000 */
#define RCC_MP_APB1LPENCLRR_DAC12LPEN             RCC_MP_APB1LPENCLRR_DAC12LPEN_Msk                  /*!< DAC1&amp;2 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENCLRR_MDIOSLPEN_Pos         (31U)
#define RCC_MP_APB1LPENCLRR_MDIOSLPEN_Msk         (0x1U << RCC_MP_APB1LPENCLRR_MDIOSLPEN_Pos)        /*!< 0x80000000 */
#define RCC_MP_APB1LPENCLRR_MDIOSLPEN             RCC_MP_APB1LPENCLRR_MDIOSLPEN_Msk                  /*!< MDIOS peripheral clocks enable during CSleep mode */

/*************  Bit definition for RCC_MP_APB2LPENSETR register  **************/
#define RCC_MP_APB2LPENSETR_TIM1LPEN_Pos          (0U)
#define RCC_MP_APB2LPENSETR_TIM1LPEN_Msk          (0x1U << RCC_MP_APB2LPENSETR_TIM1LPEN_Pos)         /*!< 0x00000001 */
#define RCC_MP_APB2LPENSETR_TIM1LPEN              RCC_MP_APB2LPENSETR_TIM1LPEN_Msk                   /*!< TIM1 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB2LPENSETR_TIM8LPEN_Pos          (1U)
#define RCC_MP_APB2LPENSETR_TIM8LPEN_Msk          (0x1U << RCC_MP_APB2LPENSETR_TIM8LPEN_Pos)         /*!< 0x00000002 */
#define RCC_MP_APB2LPENSETR_TIM8LPEN              RCC_MP_APB2LPENSETR_TIM8LPEN_Msk                   /*!< TIM8 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB2LPENSETR_TIM15LPEN_Pos         (2U)
#define RCC_MP_APB2LPENSETR_TIM15LPEN_Msk         (0x1U << RCC_MP_APB2LPENSETR_TIM15LPEN_Pos)        /*!< 0x00000004 */
#define RCC_MP_APB2LPENSETR_TIM15LPEN             RCC_MP_APB2LPENSETR_TIM15LPEN_Msk                  /*!< TIM15 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB2LPENSETR_TIM16LPEN_Pos         (3U)
#define RCC_MP_APB2LPENSETR_TIM16LPEN_Msk         (0x1U << RCC_MP_APB2LPENSETR_TIM16LPEN_Pos)        /*!< 0x00000008 */
#define RCC_MP_APB2LPENSETR_TIM16LPEN             RCC_MP_APB2LPENSETR_TIM16LPEN_Msk                  /*!< TIM16 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB2LPENSETR_TIM17LPEN_Pos         (4U)
#define RCC_MP_APB2LPENSETR_TIM17LPEN_Msk         (0x1U << RCC_MP_APB2LPENSETR_TIM17LPEN_Pos)        /*!< 0x00000010 */
#define RCC_MP_APB2LPENSETR_TIM17LPEN             RCC_MP_APB2LPENSETR_TIM17LPEN_Msk                  /*!< TIM17 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB2LPENSETR_SPI1LPEN_Pos          (8U)
#define RCC_MP_APB2LPENSETR_SPI1LPEN_Msk          (0x1U << RCC_MP_APB2LPENSETR_SPI1LPEN_Pos)         /*!< 0x00000100 */
#define RCC_MP_APB2LPENSETR_SPI1LPEN              RCC_MP_APB2LPENSETR_SPI1LPEN_Msk                   /*!< SPI/I2S1 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB2LPENSETR_SPI4LPEN_Pos          (9U)
#define RCC_MP_APB2LPENSETR_SPI4LPEN_Msk          (0x1U << RCC_MP_APB2LPENSETR_SPI4LPEN_Pos)         /*!< 0x00000200 */
#define RCC_MP_APB2LPENSETR_SPI4LPEN              RCC_MP_APB2LPENSETR_SPI4LPEN_Msk                   /*!< SPI4 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB2LPENSETR_SPI5LPEN_Pos          (10U)
#define RCC_MP_APB2LPENSETR_SPI5LPEN_Msk          (0x1U << RCC_MP_APB2LPENSETR_SPI5LPEN_Pos)         /*!< 0x00000400 */
#define RCC_MP_APB2LPENSETR_SPI5LPEN              RCC_MP_APB2LPENSETR_SPI5LPEN_Msk                   /*!< SPI5 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB2LPENSETR_USART6LPEN_Pos        (13U)
#define RCC_MP_APB2LPENSETR_USART6LPEN_Msk        (0x1U << RCC_MP_APB2LPENSETR_USART6LPEN_Pos)       /*!< 0x00002000 */
#define RCC_MP_APB2LPENSETR_USART6LPEN            RCC_MP_APB2LPENSETR_USART6LPEN_Msk                 /*!< USART6 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB2LPENSETR_SAI1LPEN_Pos          (16U)
#define RCC_MP_APB2LPENSETR_SAI1LPEN_Msk          (0x1U << RCC_MP_APB2LPENSETR_SAI1LPEN_Pos)         /*!< 0x00010000 */
#define RCC_MP_APB2LPENSETR_SAI1LPEN              RCC_MP_APB2LPENSETR_SAI1LPEN_Msk                   /*!< SAI1 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB2LPENSETR_SAI2LPEN_Pos          (17U)
#define RCC_MP_APB2LPENSETR_SAI2LPEN_Msk          (0x1U << RCC_MP_APB2LPENSETR_SAI2LPEN_Pos)         /*!< 0x00020000 */
#define RCC_MP_APB2LPENSETR_SAI2LPEN              RCC_MP_APB2LPENSETR_SAI2LPEN_Msk                   /*!< SAI2 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB2LPENSETR_SAI3LPEN_Pos          (18U)
#define RCC_MP_APB2LPENSETR_SAI3LPEN_Msk          (0x1U << RCC_MP_APB2LPENSETR_SAI3LPEN_Pos)         /*!< 0x00040000 */
#define RCC_MP_APB2LPENSETR_SAI3LPEN              RCC_MP_APB2LPENSETR_SAI3LPEN_Msk                   /*!< SAI3 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB2LPENSETR_DFSDMLPEN_Pos         (20U)
#define RCC_MP_APB2LPENSETR_DFSDMLPEN_Msk         (0x1U << RCC_MP_APB2LPENSETR_DFSDMLPEN_Pos)        /*!< 0x00100000 */
#define RCC_MP_APB2LPENSETR_DFSDMLPEN             RCC_MP_APB2LPENSETR_DFSDMLPEN_Msk                  /*!< DFSDM peripheral clocks enable during CSleep mode */
#define RCC_MP_APB2LPENSETR_ADFSDMLPEN_Pos        (21U)
#define RCC_MP_APB2LPENSETR_ADFSDMLPEN_Msk        (0x1U << RCC_MP_APB2LPENSETR_ADFSDMLPEN_Pos)       /*!< 0x00200000 */
#define RCC_MP_APB2LPENSETR_ADFSDMLPEN            RCC_MP_APB2LPENSETR_ADFSDMLPEN_Msk                 /*!< Audio DFSDM peripheral clocks enable during CSleep mode */
#define RCC_MP_APB2LPENSETR_FDCANLPEN_Pos         (24U)
#define RCC_MP_APB2LPENSETR_FDCANLPEN_Msk         (0x1U << RCC_MP_APB2LPENSETR_FDCANLPEN_Pos)        /*!< 0x01000000 */
#define RCC_MP_APB2LPENSETR_FDCANLPEN             RCC_MP_APB2LPENSETR_FDCANLPEN_Msk                  /*!< FDCAN and CANRAM peripheral clocks enable during CSleep mode */

/*************  Bit definition for RCC_MP_APB2LPENCLRR register  **************/
#define RCC_MP_APB2LPENCLRR_TIM1LPEN_Pos          (0U)
#define RCC_MP_APB2LPENCLRR_TIM1LPEN_Msk          (0x1U << RCC_MP_APB2LPENCLRR_TIM1LPEN_Pos)         /*!< 0x00000001 */
#define RCC_MP_APB2LPENCLRR_TIM1LPEN              RCC_MP_APB2LPENCLRR_TIM1LPEN_Msk                   /*!< TIM1 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB2LPENCLRR_TIM8LPEN_Pos          (1U)
#define RCC_MP_APB2LPENCLRR_TIM8LPEN_Msk          (0x1U << RCC_MP_APB2LPENCLRR_TIM8LPEN_Pos)         /*!< 0x00000002 */
#define RCC_MP_APB2LPENCLRR_TIM8LPEN              RCC_MP_APB2LPENCLRR_TIM8LPEN_Msk                   /*!< TIM8 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB2LPENCLRR_TIM15LPEN_Pos         (2U)
#define RCC_MP_APB2LPENCLRR_TIM15LPEN_Msk         (0x1U << RCC_MP_APB2LPENCLRR_TIM15LPEN_Pos)        /*!< 0x00000004 */
#define RCC_MP_APB2LPENCLRR_TIM15LPEN             RCC_MP_APB2LPENCLRR_TIM15LPEN_Msk                  /*!< TIM15 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB2LPENCLRR_TIM16LPEN_Pos         (3U)
#define RCC_MP_APB2LPENCLRR_TIM16LPEN_Msk         (0x1U << RCC_MP_APB2LPENCLRR_TIM16LPEN_Pos)        /*!< 0x00000008 */
#define RCC_MP_APB2LPENCLRR_TIM16LPEN             RCC_MP_APB2LPENCLRR_TIM16LPEN_Msk                  /*!< TIM16 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB2LPENCLRR_TIM17LPEN_Pos         (4U)
#define RCC_MP_APB2LPENCLRR_TIM17LPEN_Msk         (0x1U << RCC_MP_APB2LPENCLRR_TIM17LPEN_Pos)        /*!< 0x00000010 */
#define RCC_MP_APB2LPENCLRR_TIM17LPEN             RCC_MP_APB2LPENCLRR_TIM17LPEN_Msk                  /*!< TIM17 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB2LPENCLRR_SPI1LPEN_Pos          (8U)
#define RCC_MP_APB2LPENCLRR_SPI1LPEN_Msk          (0x1U << RCC_MP_APB2LPENCLRR_SPI1LPEN_Pos)         /*!< 0x00000100 */
#define RCC_MP_APB2LPENCLRR_SPI1LPEN              RCC_MP_APB2LPENCLRR_SPI1LPEN_Msk                   /*!< SPI/I2S1 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB2LPENCLRR_SPI4LPEN_Pos          (9U)
#define RCC_MP_APB2LPENCLRR_SPI4LPEN_Msk          (0x1U << RCC_MP_APB2LPENCLRR_SPI4LPEN_Pos)         /*!< 0x00000200 */
#define RCC_MP_APB2LPENCLRR_SPI4LPEN              RCC_MP_APB2LPENCLRR_SPI4LPEN_Msk                   /*!< SPI4 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB2LPENCLRR_SPI5LPEN_Pos          (10U)
#define RCC_MP_APB2LPENCLRR_SPI5LPEN_Msk          (0x1U << RCC_MP_APB2LPENCLRR_SPI5LPEN_Pos)         /*!< 0x00000400 */
#define RCC_MP_APB2LPENCLRR_SPI5LPEN              RCC_MP_APB2LPENCLRR_SPI5LPEN_Msk                   /*!< SPI5 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB2LPENCLRR_USART6LPEN_Pos        (13U)
#define RCC_MP_APB2LPENCLRR_USART6LPEN_Msk        (0x1U << RCC_MP_APB2LPENCLRR_USART6LPEN_Pos)       /*!< 0x00002000 */
#define RCC_MP_APB2LPENCLRR_USART6LPEN            RCC_MP_APB2LPENCLRR_USART6LPEN_Msk                 /*!< USART6 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB2LPENCLRR_SAI1LPEN_Pos          (16U)
#define RCC_MP_APB2LPENCLRR_SAI1LPEN_Msk          (0x1U << RCC_MP_APB2LPENCLRR_SAI1LPEN_Pos)         /*!< 0x00010000 */
#define RCC_MP_APB2LPENCLRR_SAI1LPEN              RCC_MP_APB2LPENCLRR_SAI1LPEN_Msk                   /*!< SAI1 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB2LPENCLRR_SAI2LPEN_Pos          (17U)
#define RCC_MP_APB2LPENCLRR_SAI2LPEN_Msk          (0x1U << RCC_MP_APB2LPENCLRR_SAI2LPEN_Pos)         /*!< 0x00020000 */
#define RCC_MP_APB2LPENCLRR_SAI2LPEN              RCC_MP_APB2LPENCLRR_SAI2LPEN_Msk                   /*!< SAI2 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB2LPENCLRR_SAI3LPEN_Pos          (18U)
#define RCC_MP_APB2LPENCLRR_SAI3LPEN_Msk          (0x1U << RCC_MP_APB2LPENCLRR_SAI3LPEN_Pos)         /*!< 0x00040000 */
#define RCC_MP_APB2LPENCLRR_SAI3LPEN              RCC_MP_APB2LPENCLRR_SAI3LPEN_Msk                   /*!< SAI3 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB2LPENCLRR_DFSDMLPEN_Pos         (20U)
#define RCC_MP_APB2LPENCLRR_DFSDMLPEN_Msk         (0x1U << RCC_MP_APB2LPENCLRR_DFSDMLPEN_Pos)        /*!< 0x00100000 */
#define RCC_MP_APB2LPENCLRR_DFSDMLPEN             RCC_MP_APB2LPENCLRR_DFSDMLPEN_Msk                  /*!< DFSDM peripheral clocks enable during CSleep mode */
#define RCC_MP_APB2LPENCLRR_ADFSDMLPEN_Pos        (21U)
#define RCC_MP_APB2LPENCLRR_ADFSDMLPEN_Msk        (0x1U << RCC_MP_APB2LPENCLRR_ADFSDMLPEN_Pos)       /*!< 0x00200000 */
#define RCC_MP_APB2LPENCLRR_ADFSDMLPEN            RCC_MP_APB2LPENCLRR_ADFSDMLPEN_Msk                 /*!< Audio DFSDM peripheral clocks enable during CSleep mode */
#define RCC_MP_APB2LPENCLRR_FDCANLPEN_Pos         (24U)
#define RCC_MP_APB2LPENCLRR_FDCANLPEN_Msk         (0x1U << RCC_MP_APB2LPENCLRR_FDCANLPEN_Pos)        /*!< 0x01000000 */
#define RCC_MP_APB2LPENCLRR_FDCANLPEN             RCC_MP_APB2LPENCLRR_FDCANLPEN_Msk                  /*!< FDCAN and CANRAM peripheral clocks enable during CSleep mode */

/*************  Bit definition for RCC_MP_APB3LPENSETR register  **************/
#define RCC_MP_APB3LPENSETR_LPTIM2LPEN_Pos        (0U)
#define RCC_MP_APB3LPENSETR_LPTIM2LPEN_Msk        (0x1U << RCC_MP_APB3LPENSETR_LPTIM2LPEN_Pos)       /*!< 0x00000001 */
#define RCC_MP_APB3LPENSETR_LPTIM2LPEN            RCC_MP_APB3LPENSETR_LPTIM2LPEN_Msk                 /*!< LPTIM2 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB3LPENSETR_LPTIM3LPEN_Pos        (1U)
#define RCC_MP_APB3LPENSETR_LPTIM3LPEN_Msk        (0x1U << RCC_MP_APB3LPENSETR_LPTIM3LPEN_Pos)       /*!< 0x00000002 */
#define RCC_MP_APB3LPENSETR_LPTIM3LPEN            RCC_MP_APB3LPENSETR_LPTIM3LPEN_Msk                 /*!< LPTIM3 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB3LPENSETR_LPTIM4LPEN_Pos        (2U)
#define RCC_MP_APB3LPENSETR_LPTIM4LPEN_Msk        (0x1U << RCC_MP_APB3LPENSETR_LPTIM4LPEN_Pos)       /*!< 0x00000004 */
#define RCC_MP_APB3LPENSETR_LPTIM4LPEN            RCC_MP_APB3LPENSETR_LPTIM4LPEN_Msk                 /*!< LPTIM4 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB3LPENSETR_LPTIM5LPEN_Pos        (3U)
#define RCC_MP_APB3LPENSETR_LPTIM5LPEN_Msk        (0x1U << RCC_MP_APB3LPENSETR_LPTIM5LPEN_Pos)       /*!< 0x00000008 */
#define RCC_MP_APB3LPENSETR_LPTIM5LPEN            RCC_MP_APB3LPENSETR_LPTIM5LPEN_Msk                 /*!< LPTIM5 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB3LPENSETR_SAI4LPEN_Pos          (8U)
#define RCC_MP_APB3LPENSETR_SAI4LPEN_Msk          (0x1U << RCC_MP_APB3LPENSETR_SAI4LPEN_Pos)         /*!< 0x00000100 */
#define RCC_MP_APB3LPENSETR_SAI4LPEN              RCC_MP_APB3LPENSETR_SAI4LPEN_Msk                   /*!< SAI4 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB3LPENSETR_SYSCFGLPEN_Pos        (11U)
#define RCC_MP_APB3LPENSETR_SYSCFGLPEN_Msk        (0x1U << RCC_MP_APB3LPENSETR_SYSCFGLPEN_Pos)       /*!< 0x00000800 */
#define RCC_MP_APB3LPENSETR_SYSCFGLPEN            RCC_MP_APB3LPENSETR_SYSCFGLPEN_Msk                 /*!< SYSCFG peripheral clocks enable during CSleep mode */
#define RCC_MP_APB3LPENSETR_VREFLPEN_Pos          (13U)
#define RCC_MP_APB3LPENSETR_VREFLPEN_Msk          (0x1U << RCC_MP_APB3LPENSETR_VREFLPEN_Pos)         /*!< 0x00002000 */
#define RCC_MP_APB3LPENSETR_VREFLPEN              RCC_MP_APB3LPENSETR_VREFLPEN_Msk                   /*!< VREF peripheral clocks enable during CSleep mode */
#define RCC_MP_APB3LPENSETR_DTSLPEN_Pos           (16U)
#define RCC_MP_APB3LPENSETR_DTSLPEN_Msk           (0x1U << RCC_MP_APB3LPENSETR_DTSLPEN_Pos)          /*!< 0x00010000 */
#define RCC_MP_APB3LPENSETR_DTSLPEN               RCC_MP_APB3LPENSETR_DTSLPEN_Msk                    /*!< DTS peripheral clocks enable during CSleep mode */

